const container = document.querySelector(".container"),
      dropdown = document.getElementById("dropdownMenu"),
      infoText = container.querySelector(".info-text");

const dictionary = {
        "οι αντίξοες καιρικές συνθήκες": {
          "definition": "Που δημιουργούν δυσκολίες και προβλήματα ή βάζουν εμπόδια. ",
          "example": "Oι κάτοικοι των ορεινών περιοχών ταλαιπωρούνται από τις αντίξοες καιρικές συνθήκες."
        },
        "η αυτοπεποίθηση": {
          "definition": "Η εμπιστοσύνη ενός ανθρώπου στις δυνάμεις και στις ικανότητές του, στον εαυτό του. ",
          "example": "Η μαθήτρια απάντησε στην ερώτηση της δασκάλας με αυτοπεποίθηση."
        },
        "η βάρδια": {
          "definition": "Ομάδα εργαζομένων που διαδέχεται κάποια άλλη.",
          "example": "Οι φύλακες στο εργοστάσιο απασχολούνται σε διαφορετικές βάρδιες."
        },
        "ο επιβαρυντικός παράγοντας": {
          "definition": "Οτιδήποτε επιδρά αρνητικά σε κάτι και το χειροτερεύει. ",
          "example": "Το καυσαέριο είναι επιβαρυντικός παράγοντας για την υγεία μας."
        },
        "εθελοντικά": {
          "definition": "Με τη θέλησή μου, χωρίς αμοιβή ή όφελος για μένα.",
          "example": "Κάποιοι άνθρωποι δοκιμάζουν τα νέα φάρμακα εθελοντικά."
        },
        "εύπορος/η/ο": {
          "definition": "Που βρίσκεται σε καλή οικονομική κατάσταση.",
          "example": "Οι εύπορες οικογένειες μπορούν να προσλάβουν δασκάλους στο σπίτι."
        },
        "ευφυής/ής/ές": {
          "definition": "Το πρόσωπο που έχει μεγάλες νοητικές ικανότητες, όπως είναι για παράδειγμα η αντίληψη και η μνήμη",
          "example": "Μόνο οι 5 στους 10 ανθρώπους είναι αρκετά ευφυείς για να απαντήσουν αυτή την ερώτηση."
        },
        "κατ΄οίκον": {
          "definition": "Στο σπίτι. ",
          "example": "Yπάρχουν παιδιά σε όλο τον κόσμο που κάνουν μάθημα κατ΄οίκον."
        },
        "μονολογώ": {
          "definition": "Μιλάω μόνος μου, χωρίς να απευθύνομαι σε κάποιον άλλον/κάποια άλλη. ",
          "example": "O παππούς μου μονολογούσε συχνά."
        },
        "ο όμιλος": {
          "definition": "Ομάδα ανθρώπων που έχουν κοινά ενδιαφέροντα. ",
          "example": "Είμαι μέλος στον κωπηλατικό όμιλο της περιοχής μου."
        },
        "προνομιούχος/α/ο": {
          "definition": "Που έχει προνόμιο ή προνόμια που του εξασφαλίζουν ευνοϊκή θέση ή μεταχείριση. ",
          "example": "Στην αρχαία Ελλάδα  όλες οι κοινωνικές τάξεις δεν ήταν το ίδιο προνομιούχες."
        },
        "προσαρμόζω": {
          "definition": "Αλλάζω κάτι ή το τροποποιώ ώστε να ταιριάζει ή να συμφωνεί με κάτι άλλο. ",
          "example": "Oι μαθητές προσαρμόζουν τα εξωσχολικό τους πρόγραμμα στο πρόγραμμα του σχολείου."
        },
        "συγκλονιστικός/ή/ό": {
          "definition": "Που προκαλεί ισχυρή συγκίνηση, έκπληξη ή αναστάτωση. ",
          "example": "Eίδα ένα πίνακα ζωγραφικής στο μουσείο που ήταν συγκλονιστικός."
        },
        "τα πιάνω": {
          "definition": "Αντιλαμβάνομαι, κατανοώ, εννοώ. ",
          "example": "Ο Γιάννης τα πιάνει γρήγορα στα μαθηματικά"
        },
        "η τιτάνια προσπάθεια": {
          "definition": "Οποιαδήποτε προσπάθεια ξεπερνάει τις ανθρώπινες δυνατότητες, γιγάντια, υπεράνθρωπη προσπάθεια. ",
          "example": "Oι αθλητές στους ολυμπιακούς αγώνες κάνουν τιτάνια προσπάθεια για να κατακτήσουν τις τρεις πρώτες θέσεις."
        },
      };

function search() {
    container.classList.remove("active");
   infoText.style.color = "#000";

    var word = dropdown.options[dropdown.selectedIndex].text;

    infoText.innerHTML = `Αναζήτηση της λέξης <span>"${word}"</span>`;

    if (!dictionary[word]) {
        infoText.innerHTML = `Δεν μπόρεσα να βρω τη λέξη <span>"${word}"</span>. Παρακαλώ, δοκίμασε να ψάξεις μια άλλη λέξη!`
    }
    else {
        container.classList.add("active");    
        document.querySelector(".meaning span").innerText = dictionary[word].definition;
        document.querySelector(".example span").innerHTML = dictionary[word].example;
    }
}
