const dictionary = [[
    {
    "θαλάσσια ζωή": {
      "meaning": ["Οι ζωντανοί οργανισμοί (ζώα και φυτά) που ζουν σε αλμυρό νερό, σε θάλασσες ή ωκεανούς."],
      "example": ["Στα θαλάσσια πάρκα προστατεύονται όλα τα είδη της θαλάσσιας ζωής."],
    },             
  }],
  [ {
    "Αμερική": {
      "meaning": ["Είναι μία από τις πέντε ηπείρους και βρίσκεται στο δυτικό ημισφαίριο της γης."],
      "example": ["Όταν λέμε Αμερική χρειάζεται να διευκρινίζουμε αν μιλάμε για τη βόρεια ή τη νότια."],
    },  
    "βιώσιμη αλιεία": {
      "meaning": ["Το βιώσιμο ψάρεμα, δηλαδή το ψάρεμα ψαρικών στη σωστή εποχή, στο σωστό μέγεθος και στη σωστή ποσότητα."],
      "example": ["Η Ανίτα πρότεινε στον μπαμπά της να μην μαγειρεύουν γόνο και απειλούμενα είδη και αυτό είπε ότι ονομάζεται βιώσιμη αλιεία."],
    },  
    "Γαλλία": {
      "meaning": ["Είναι κράτος στην ήπειρο της Ευρώπης."],
      "example": ["Πρωτεύουσα της Γαλλίας είναι το Παρίσι."],
    },  
    "θαλάσσια πάρκα": {
      "meaning": ["Προστατευόμενη περιοχή στη θάλασσα για την προστασία θαλάσσιων ειδών όπως η χελώνα καρέτα-καρέτα, η μεσογειακή φώκια μονάχους-μονάχους, κ.α."],
      "example": ["Στην Ελλάδα έχουμε δύο θαλάσσια πάρκα: της Αλοννήσου στις Βόρειες Σποράδες και της Ζακύνθου."],
    },   

    "ιχθυοπωλείο": {
      "meaning": ["Το ψαράδικο."],
      "example": ["Αγόρασα ψάρια από το ιχθυοπωλείο της γειτονιάς μου."],
    }, 
    "κουλ": {
      "meaning": ["Στα αγγλικά σημαίνει δροσερός, αλλά ανεπίσημα στη γλώσσα μας έχει επικρατήσει να σημαίνει κάτι το ωραίο, κάτι που εγκρίνουμε, που μας αρέσει."],
      "example": ["Είναι κουλ να βάζεις δροσερό νεράκι στα αδέσποτα ζώα."],
    },  
    "Μπαγκλαντές": {
      "meaning": ["Χώρα της Νότιας Ασίας, συνορεύει με την Ινδία και τη Μιανμάρ"],
      "example": ["Η πρωτεύουσα του Μπαγκλαντές είναι η Ντάκα."],
    },   
    "πανσέληνος": {
      "meaning": ["Πανσέληνο έχουμε όταν το ημισφαίριο της Σελήνης (δορυφόρος της γης) φαίνεται ολόκληρο."],
      "example": ["Λέμε ότι έχουμε πανσέληνο όταν βλέπουμε ολόγιομο (ολόκληρο) το φεγγάρι."],
    },   
      "Τήνος": {
        "meaning": ["Το τέταρτο σε μέγεθος νησί των Κυκλάδων (βόρειες Κυκλάδες)."],
        "example": ["Στην Τήνο βρίσκεται η διάσημη εκκλησία της Παναγίας της Ευαγγελίστριας (Παναγίας της Τήνου), όπως συνήθως λέγεται."],
      },   
      "τροφικό πλέγμα": {
        "meaning": ["Τα ζώα που τρέφονται το ένα από το άλλο αποτελούν τους κρίκους της τροφικής αλυσίδας. Οι κρίκοι αυτοί σχηματίζουν το τροφικό πλέγμα."],
        "example": ["Κρίκοι στο τροφικό πλέγμα είναι τα φυτά που τρώγονται από τα φυτοφάγα ζώα κι αυτά από τα σαρκοφάγα."],
      },   
      "υπεραλίευση": {
        "meaning": ["Το ψάρεμα σε υπερβολική ποσότητα, που οδηγεί στη μείωση ή την εξαφάνιση ειδών (ψαριών) που δεν προλαβαίνουν να μεγαλώσουν και να αναπαραχτούν."],
        "example": ["Εξαιτίας της υπεραλίευσης, πολλά είδη ψαριών όπως ο ροφός, ο τόνος, κ.α. κινδυνεύουν να εξαφανιστούν."],
      },  
 }],
 [{
    "αλιεύματα": {
      "meaning": ["Οτιδήποτε ψαρεύεται, τα ψαρικά."],
      "example": ["Υπάρχει κατάλληλο μέγεθος για τα αλιεύματα που πρέπει να αγοράζουμε."],
    },   
      "αλίευση": {
      "meaning": ["Το ψάρεμα."],
      "example": ["Η αλίευση σε περιοχές που δεν επιτρέπεται και υπάρχει σήμανση είναι παράνομη."],
    }, 
      "αναπαραγωγική ηλικία": {
      "meaning": ["Σε κατάλληλη ηλικία για γονιμοποίηση δηλαδή για τη δημιουργία απογόνων."],
      "example": ["Οι γόνοι, δηλαδή τα πολύ μικρά ψάρια που δεν έχουν φτάσει σε αναπαραγωγική ηλικία απαγορεύεται να ψαρεύονται."],
    },   
      "Αργυρώ Μπαρμπαρίγου": {
      "meaning": ["Ελληνίδα σεφ (αρχιμαγείρισσα)."],
      "example": ["Η Αργυρώ Μπαρμπαρίγου έχει ιστοσελίδα με πολύ νόστιμες συνταγές."],
    },   
      "γόνος": {
      "meaning": ["Τα αβγά των ψαριών ή τα νεογέννητα ψαράκια"],
      "example": ["Δεν αγοράζουμε γόνο αλλά ψάρια που έχουν το επιτρεπόμενο μέγεθος."],
    }, 
    "Δημήτρης Σκαρμούτσος": {
      "meaning": ["Έλληνας σεφ (αρχιμάγειρας)."],
      "example": ["Ο Δημήτρης Σκαρμούτσος έχει συμμετάσχει πολλές φορές σε μαγειρικές εκπομπές και τον έχουμε δει να μαγειρεύει για τους τηλεθεατές."],
    },  
    "ενσυνείδητος καταναλωτής": {
      "meaning": ["Ο υπεύθυνος καταναλωτής, αυτός που δεν υπερκαταναλώνει."],
      "example": ["Ενσυνείδητος καταναλωτής είναι αυτός που αγοράζει ό,τι χρειάζεται και δεν παρασύρεται από μία ελκυστική διαφήμιση."],
    },   
    "Ευρωπαϊκή Επιτροπή": {
      "meaning": ["Είναι η επιτροπή (το θεσμικό όργανο) που προστατεύει τα συμφέροντα των χωρών που είναι μέλη της Ευρωπαϊκής ένωσης."],
      "example": ["Η Ευρωπαϊκή επιτροπή βρίσκεται στις Βρυξέλλες και αναφέρεται συχνά ως Κομισιόν."],
    },     
    "καμπάνια": {
      "meaning": ["Ιταλική λέξη που σημαίνει εκστρατεία."],
      "example": ["Όλη η τάξη μας θα συμμετέχει στην καμπάνια για την προστασία του περιβάλλοντος."],
    }, 
    "Λευτέρης Λαζάρου": {
      "meaning": ["Έλληνας σεφ (αρχιμάγειρας)."],
      "example": ["Ο Λευτέρης Λαζάρου έχει βραβευτεί με αστέρι Μισελέν για τη μαγειρική του."],
    },   
    "πρεσβευτές": {
      "meaning": ["Πρέσβεις, διπλωμάτες"],
      "example": ["Πρεσβευτές ονομάζονται οι εκπρόσωποι (αντιπρόσωποι) της χώρας μας στο εξωτερικό."],
    },   
    }],
    [{
      "ακραία καιρικά φαινόμενα": {
        "meaning": ["Ασυνήθιστα φαινόμενα του καιρού σε μία περιοχή όπως οι καύσωνες, οι καταιγίδες, οι τυφώνες κ.α."],
        "example": ["Οι μετεωρολόγοι προέβλεψαν ακραία καιρικά φαινόμενα στην πόλη μας για το Σαββατοκύριακο."],
      },  
      "άνοδος της στάθμης της θάλασσας": {
        "meaning": ["Άνοδος του ύψους του νερού από την επιφάνεια της θάλασσας."],
        "example": ["Με το λιώσιμο των πάγων παρατηρείται άνοδος της στάθμης της θάλασσας."],
      },  
      "βροχοπτώσεις": {
        "meaning": ["Η βροχή που πέφτει από τα σύννεφα."],
        "example": ["Το φετινό ετήσιο ύψος βροχοπτώσεων ήταν χαμηλότερο κατά μέσο όρο φέτος."],
      },  
      "διαθεσιμότητα γλυκού νερού": {
        "meaning": ["Επάρκεια σε αποθέματα γλυκού νερού, δηλαδή πόσο γλυκό νερό διαθέτουμε, έχουμε στη διάθεσή μας."],
        "example": ["Αν δεν βρέξει καθόλου, η διαθεσιμότητα γλυκού νερού θα μειωθεί πάρα πολύ και θα έχουμε έλλειψη νερού (λειψυδρία)."],
      },  
      "έλλειψη βροχοπτώσεων": {
        "meaning": ["Απουσία βροχής."],
        "example": ["Η έλλειψη βροχοπτώσεων σε μια περιοχή οδηγεί σε ξηρασία."],
      },  
      "εξάτμιση των υδάτων": {
        "meaning": ["Η μετατροπή χωρίς βρασμό του νερού σε αέριο."],
        "example": ["Η εξάτμιση των υδάτων, δηλαδή του νερού που υπάρχει σε μία περιοχή ευθύνεται για την  ξηρασία στην περιοχή αυτή."],
      },   
      "επιπτώσεις": {
        "meaning": ["Συνέπειες."],
        "example": ["Οι επιπτώσεις των πράξεων μας θα είναι πολύ σοβαρές, αν δεν πάρουμε μέτρα προστασίας για το περιβάλλον."],
      },   
      "καύσωνες": {
        "meaning": ["Είναι μια περίοδος με πάρα πολύ ζέστη εξαιτίας πολύ υψηλών θερμοκρασιών."],
        "example": ["Στην Ελλάδα τα τελευταία χρόνια παρατηρούνται πολύ πιο συχνά συνθήκες ακραίου καύσωνα και η θερμοκρασία ανεβαίνει πάνω από 40 βαθμούς Κελσίου."],
      },   
      "κελσίου": {
        "meaning": ["Είναι η μονάδα μέτρησης της θερμοκρασίας (κλίμακα) σε βαθμούς και ονομάζεται έτσι από τον αστρονόμο και μαθηματικό Άντερς Κέλσιου."],
        "example": ["Το νερό βράζει στους εκατό βαθμούς κελσίου (100 °C)"],
      },   
      "κλιματική αλλαγή": {
      "meaning": ["Το κλίμα μεταβάλλεται εξαιτίας αλλαγών στη φύση αλλά και εξαιτίας των δραστηριοτήτων του ανθρώπου."],
      "example": ["Αποτέλεσμα της κλιματικής αλλαγής είναι η άνοδος της θερμοκρασίας και οι καύσωνες."],
    },   
    "να αναληφθούν δράσεις": {
      "meaning": ["Να παρθούν μέτρα αντιμετώπισης."],
      "example": ["Χρειάζεται να αναληφθούν δράσεις για να μην καταλήγουν τα πλαστικά μπουκάλια στις θάλασσές μας."],
    },   
    "ξηρασίες": {
      "meaning": ["Συμβαίνουν όταν για ένα χρονικό διάστημα δεν έχει βρέξει και παρατηρείται έλλειψη νερού."],
      "example": ["Με την κλιματική αλλαγή παρατηρείται έντονα το φαινόμενο της ξηρασίας αφού έχουν μειωθεί πολύ οι βροχές και έχουμε πιο συχνά καύσωνες."],
    },  
    "οξίνιση των ωκεανών": {
      "meaning": ["Είναι το φαινόμενο της απορρόφησης διοξειδίου του άνθρακα από το θαλασσινό νερό και η μετατροπή του σε ανθρακικό οξύ."],
      "example": ["Το φαίνομενο της οξίνισης των ωκεανών επηρεάζει τα κοράλλια."],
    },   
    "παγετώνες": {
      "meaning": ["Είναι οι τεράστιες ποσότητες πάγου που μετακινούνται λόγω του χιονιού που συμπιέζεται."],
      "example": ["Παγετώνες υπάρχουν στην Αρκτική και την Ανταρκτική."],
    },   
    "περιοχή της Μεσογείου": {
      "meaning": ["Η περιοχή της Μεσογείου θάλασσας ανάμεσα στην Ευρώπη την Αφρική κι ανατολικά της Ασίας. Περιλαμβάνει ενδεικτικά τις χώρες: Ελλάδα, Ιταλία, Ισπανία, Μονακό, Μάλτα, Κύπρος, κ.α."],
      "example": ["Η περιοχή της Μεσογείου έχει ήπιο κλίμα που ονομάζεται Μεσογειακό."],
    },   
    "πλημμύρες": {
      "meaning": ["Έχουμε όταν το νερό υπερχειλίσει και καλύψει τη στεριά για παράδειγμα από ένα ποτάμι ή μια λίμνη."],
      "example": ["Ένα μέτρο προστασίας από τις πλημμύρες είναι να είναι καθαρά τα φρεάτια των δρόμων."],
    },  
    "πτυχές": {
      "meaning": ["Επίπεδα της ζωής μας."],
      "example": ["Οι επιπτώσεις της κλιματικής αλλαγής επηρεάζουν πολλές διαφορετικές πτυχές της ζωής μας."],
    },  
    "στάθμη": {
      "meaning": ["Το ύψος του νερού από την επιφάνεια της θάλασσας."],
      "example": ["Δεν έβρεξε πολύ φέτος και έπεσε η στάθμη του νερού στη λίμνη Υλίκη."],
    },   
  
    "ωκεανοί": {
      "meaning": ["Λέγονται οι τεράστιες θαλάσσιες επιφάνειες."],
      "example": ["Οι ωκεανοί είναι πέντε: ο Ειρηνικός, ο Ατλαντικός, ο Ινδικός, ο Αρκτικός και ο Ανταρκτικός Ωκεανός."],
    },    
 }],
 [{
      "αέρια του θερμοκηπίου": {
      "meaning": ["Ονομάζονται τα αέρια που προκαλούν το φαινόμενο του θερμοκηπίου, όπως το διοξείδιο του άνθρακα, το μεθάνιο, το όζον, κ.α. τα οποία απορροφούν και εκπέμπουν ενέργεια ακτινοβολίας."],
      "example": ["Τα αέρια του θερμοκηπίου συντελούν στην άνοδο της θερμοκρασίας του πλανήτη μας."],
    },   
    "θαλάσσια οξίνιση": {
      "meaning": ["Η αλλαγή του θαλασσινού νερού σε πιο όξινο εξαιτίας των αερίων του θερμοκηπίου."],
      "example": ["Αποτέλεσμα της θαλάσσιας οξίνισης είναι τα κοράλλια, το πλαγκτόν και τα οστρακοειδή να δυσκολεύονται να δημιουργήσουν το κέλυφος και το σκελετό τους."],
    },   
      "κοραλλιογενείς υφάλους": {
      "meaning": ["Στους κοραλλιογενείς υφάλους που δημιουργήθηκαν από τα κοράλλια καταφεύγουν πολλά είδη ψαριών."],
      "example": ["Οι κοραλλιογενείς ύφαλοι και οι ανεμώνες είναι ένα ασφαλές σπίτι για πολλά θαλάσσια είδη."],
    },   
    "ορυκτά καύσιμα": {
      "meaning": ["Καύσιμα όπως είναι το κάρβουνο, το πετρέλαιο, το φυσικό αέριο προέρχονται από την αποσύνθεση στη  φύση νεκρών οργανισμών."],
      "example": ["Τ.α ορυκτά καύσιμα χρησιμοποιούνταν από τους ανθρώπους ήδη από τον 19ο αιώνα"],
    },   
    "χημική της σύνθεση": {
      "meaning": ["Η αλλαγή στη σύνθεση του θαλασσινού νερού σε πιο όξινο εξαιτίας των αερίων του θερμοκηπίου."],
      "example": ["Η χημική σύνθεση της θάλασσας αλλάζει εξαιτίας της απορρόφησης διοξειδίου του άνθρακα."],
    },   
}],
[{
      "αντίκτυπος": {
      "meaning": ["Συνέπεια, επίπτωση"],
      "example": ["Ο αντίκτυπός των πράξεων του ανθρώπου είναι φανερός πλέον με την κλιματική αλλαγή και την άνοδο της θερμοκρασίας του πλανήτη."],
    },   
    "κινητοποίηση": {
      "meaning": ["Κινήσεις/δράσεις για την αντιμετώπιση κάποιου προβλήματος, για την επίτευξη κάποιου κοινού σκοπού/στόχου."],
      "example": ["Οι κινητοποιήσεις των εργαζομένων είχαν θετικό αποτέλεσμα αφού πήραν γενναία (μεγάλη) αύξηση!"],
    },   
    "συναγωνίζεται": {
      "meaning": ["Αγωνίζεται μαζί με κάποιον, για τον ίδιο σκοπό ή ανταγωνίζεται όχι όμως με αντιπαλότητα."],
      "example": ["Η Ισμήνη συναγωνίζεται στο τρέξιμο με την δίδυμη αδελφή της."],
    },   
 }]
];