const container = document.querySelector(".container"),
      dropdown = document.getElementById("dropdownMenu"),
      infoText = container.querySelector(".info-text");

const dictionary = {
        "η εισβολή": {
          "definition": "Η επίθεση εχθρικών στρατιωτικών δυνάμεων που περνούν τα σύνορα και μπαίνουν σε μια χώρα με σκοπό την κατάκτησή της.",
          "example": "Η εισβολή των Τούρκων  στην Κύπρο έγινε το 1974."
        },
        "εκκωφαντικός/ή/ό": {
          "definition": "Πολύ δυνατός θόρυβος.",
          "example": "Τα πυροτεχνήματα στον ουρανό προκάλεσαν έναν εκκωφαντικό θόρυβο."
        },
        "η ενέδρα": {
          "definition": "Στημένη παγίδα.",
          "example": "Ο γάτος έστησε ενέδρα στο ποντίκι."
        },
        "επίκαιρος/η/ο": {
          "definition": "Κάτι που αφορά το παρόν.",
          "example": "Το θέμα της καταστροφής του περιβάλλοντος είναι επίκαιρο και αφορά τον καθένα μας."
        },
        "το καρτέρι": {
          "definition": "Ενέδρα, παγίδα.",
          "example": "Του έστησαν καρτέρι και τον λήστεψαν στη στροφή του δρόμου."
        },
        "ο καταυλισμός": {
          "definition": "Η προσωρινή εγκατάσταση στρατιωτικών ή άλλης ομάδας ατόμων, όπως π.χ. προσφύγων στην ύπαιθρο ή σε πρόχειρα καταλύματα (π.χ. αντίσκηνα)",
          "example": "Οι πρόσφυγες της Κύπρου, μετά την εισβολή του 1974, τους πρώτους μήνες έμεναν σε καταυλισμούς, αφού έχασαν τα σπίτια τους."
        },
        "ο συνοικισμός": {
          "definition": "Ομάδα σπιτιών σε μια περιοχή, όπου προηγουμένως δεν υπήρχαν άλλα, καταυλισμός για πρόσφυγες που κτίζονται από το κράτος σε μια περιοχή.",
          "example": "Η κυπριακή δημοκρατία, μετά την τουρκική εισβολή, έκτισε συνοικισμούς για να στεγάσει τους πρόσφυγες της τουρκικής εισβολής."
        },
        "η τουρτούρα": {
          "definition": "Ρίγος/τρεμούλιασμα που προκαλείται από το μεγάλο κρύο.",
          "example": "Λόγω του μεγάλου κρύου, δεν μπορέσαμε να γλυτώσουμε την τουρτούρα και τρέμαμε συνεχώς.."
        },
        "το τροχοφόρο": {
          "definition": "Όχημα που κινείται πάνω σε τροχούς.",
          "example": "Το τανκ είναι ένα στρατιωτικό τροχοφόρο."
        },
        "το ξέφωτο": {
          "definition": "Το πρώτο φως λίγο πριν την ανατολή του ήλιου.",
          "example": "Παρόλο που νυστάζουμε, με το χάραμα ξεκινάμε για το σχολείο."
        },
        "ψηλαφιστά": {
          "definition": "Όταν ψάχνουμε κάτι αγγίζοντας και χωρίς να βλέπουμε.",
          "example": "Η τυφλόμυγα παίζεται ψηλαφιστά."
        },
      };

function search() {
    container.classList.remove("active");
   infoText.style.color = "#000";

    var word = dropdown.options[dropdown.selectedIndex].text;

    infoText.innerHTML = `Αναζήτηση της λέξης <span>"${word}"</span>`;

    if (!dictionary[word]) {
        infoText.innerHTML = `Δεν μπόρεσα να βρω τη λέξη <span>"${word}"</span>. Παρακαλώ, δοκίμασε να ψάξεις μια άλλη λέξη!`
    }
    else {
        container.classList.add("active");    
        document.querySelector(".meaning span").innerText = dictionary[word].definition;
        document.querySelector(".example span").innerText = dictionary[word].example;
    }
}
