const container = document.querySelector(".container"),
      dropdown = document.getElementById("dropdownMenu"),
      infoText = container.querySelector(".info-text");

const dictionary = {
        "αποταμιεύω": {
          "definition": "κρατώ για μελλοντική χρήση ό,τι περισσεύει από τη μετρημένη και όχι αλόγιστη κατανάλωση κάποιου υλικού αγαθού",
          "example": "Αποταμιεύω λεφτά στον κουμπαρά μου."
        },
        "διά παντός": {
          "definition": "για πάντα, παντοτινά",
          "example": "Σταμάτησε να μου μιλάει διά παντός. "
        },
        "επιταχύνω": {
          "definition": "κάνω κάτι πιο γρήγορο, αυξάνω την ταχύτητα, κάνω κάτι να συμβεί πιο σύντομα",
          "example": "Οι υψηλές θερμοκρασίες επιτάχυναν την τήξη των πάγων."
        }, 
        "θραύσμα": {
          "definition": "καθένα από τα πολλά μικρά κομμάτια στα οποία διασπάστηκε ένα αντικείμενο που έσπασε",
          "example": "Επιστρέφει το πρώτο θραύσμα του Παρθενώνα."
        },
        "λιθογραφία": {
          "definition": "η τέχνη της εκτύπωσης πάνω σε χαρτί στοιχείων ή εικόνων που χαράχτηκαν πριν σε ειδική λίθινη πλάκα",
          "example": "Στην γκαλερί εκτέθηκαν λιθογραφίες και μεταξοτυπίες."
        },
        "περιφορά": {
          "definition": "περιοδική κίνηση ενός ουράνιου σώματος γύρω από ένα άλλο",
          "example": "Περιφορά των πλανητών γύρω από τον Ήλιο."
        },
        "προσαρτώ": {
          "definition": "ενσωματώνω εδάφη στην επικράτειά μου, συνδέω ή ενώνω κάτι σε κάτι άλλο",
          "example": "H Κρήτη προσαρτήθηκε οριστικά στην Ελλάδα την 1η Δεκεμβρίου 1913."
        },
        "πρόσκρουση": {
          "definition": "σύγκρουση κινούμενου αντικειμένου με κάτι ακίνητο",
          "example": "Το «κρας τεστ» λέγονται οι δοκιμές πρόσκρουσης αυτοκινήτου."
        },
        "τηλεσκόπιο": {
          "definition": "οπτικό όργανο που αποτελείται από ένα σωλήνα με ισχυρούς φακούς στα άκρα του, κατάλληλο για την παρατήρηση αντικειμένων που βρίσκονται πολύ μακριά και κυρίως των ουράνιων σωμάτων",
          "example": "Τα αστεροσκοπεία διαθέτουν ισχυρότατα τηλεσκόπια."
        },
        "υποβιβάζω/ομαι": {
          "definition": "υποβαθμίζω, αντιμετωπίζω κάποιον ή κάτι ως λιγότερο σημαντικό από ό,τι είναι, τοποθετώ κάποιον ή κάτι σε κατώτερη θέση ή βαθμίδα σε σχέση με αυτή στην οποία βρίσκεται",
          "example": "Η ομάδα υποβιβάστηκε στη Β΄ Εθνική."
        },
                
      };

function search() {
    container.classList.remove("active");
   infoText.style.color = "#000";

    var word = dropdown.options[dropdown.selectedIndex].text;

    infoText.innerHTML = `Αναζήτηση της λέξης <span>"${word}"</span>`;

    if (!dictionary[word]) {
        infoText.innerHTML = `Δεν μπόρεσα να βρω τη λέξη <span>"${word}"</span>. Παρακαλώ, δοκίμασε να ψάξεις μια άλλη λέξη!`
    }
    else {
        container.classList.add("active");    
        document.querySelector(".meaning span").innerText = dictionary[word].definition;
        document.querySelector(".example span").innerHTML = dictionary[word].example;
    }
}
