const container = document.querySelector(".container"),
      dropdown = document.getElementById("dropdownMenu"),
      infoText = container.querySelector(".info-text");

const dictionary = {
        "αοριστία": {
          "definition": "κατάσταση που χαρακτηρίζεται από την απουσία σαφών, ορατών και ξεκαθαρισμένων στόχων",
          "example": "H αοριστία του νόμου άφηνε πολλά περιθώρια για παρερμηνείες."
        },
        "απόκοσμος": {
          "definition": "που μοιάζει να προέρχεται από άλλο κόσμο, με αποτέλεσμα να προκαλεί μεταφυσική εμπειρία",
          "example": "Το βλέμμα του έχει κάτι το σκοτεινό και απόκοσμο. "
        },
        "έκφανση": {
          "definition": "ο τρόπος και η μορφή με την οποία εμφανίζεται ή εκδηλώνεται κάτι",
          "example": "Οι ποικίλες εκφάνσεις της ζωής."
        }, 
        "η έλλειψη": {
          "definition": "Η απουσία.",
          "example": "Υπάρχει έλλειψη νερού, γιατί φέτος δεν έβρεξε αρκετά. (κυριολεξία) <br><br>Υπάρχει έλλειψη ησυχίας, γιατί η μουσική είναι πολύ δυνατή και ενοχλητική. (μεταφορά)"
        },
        "εμβληματικός": {
          "definition": "που αποτελεί πρότυπο ή σύμβολο, αντιπροσωπευτικός",
          "example": "Η Μόνα Λίζα είναι ένα εμβληματικό έργο του Λεονάρντο Ντα Βίντσι."
        },
        "κυοφορείται (-ώ/ούμαι)": {
          "definition": "προετοιμάζει κάτι που πρόκειται να εκδηλωθεί στο μέλλον, όταν ωριμάσει, πρόκειται ή αναμένεται να συμβεί (μεταφορικά)",
          "example": "Κυοφορούνται νέες εξελίξεις."
        },
        "ντελάλης": {
          "definition": "κήρυκας που ανήγγελλε μεγαλόφωνα είδηση ή γεγονός στις γειτονιές πόλης ή χωριού.",
          "example": "Οι άρχοντες έβαλαν ντελάληδες να διαλαλήσουν τον ερχομό των εχθρών."
        },
        "ντελικάτος": {
          "definition": "λεπτός και κομψός, χαριτωμένος, φινετσάτος, ευαίσθητος",
          "example": "Είναι ένας ευγενικός και ντελικάτος άνθρωπος"
        },
        "ντουνιάς": {
          "definition": "ο κόσμος",
          "example": "Θα φωνάξω να μ’ ακούσει όλος ο ντουνιάς."
        },
        "πλειστηριασμός": {
          "definition": "διαδικασία με την οποία πουλιούνται, εκποιούνται κινητά ή ακίνητα πράγματα ενός οφειλέτη, σε όποιον προσφέρει τη μεγαλύτερη τιμή",
          "example": "Επιστολές της Μαρίας Κάλλας βγήκαν σε πλειστηριασμό."
        },
        "προσωπογραφία": {
          "definition": "ζωγραφική αναπαράσταση του προσώπου ενός ατόμου, με πιστή απόδοση των χαρακτηριστικών του, πορτρέτο",
          "example": "Μπαίνοντας στο σπίτι, πάνω από το τζάκι, βρίσκεται η προσωπογραφία του παππού μου."
        },
        "σάρκα και οστά": {
          "definition": "έκφραση που λέγεται για την υλοποίηση μιας σκέψης, ενός σχεδίου, ή για την πραγματοποίηση ενός ονείρου",
          "example": "Το σχέδιο μου πήρε σάρκα και οστά."
        },
        "στεντόρειος": {
          "definition": "ηχηρός, δυνατός, βροντερός",
          "example": "Η στεντόρεια φωνή του πατέρα μου ακουγόταν από τον δρόμο."
        },
                
      };

function search() {
    container.classList.remove("active");
   infoText.style.color = "#000";

    var word = dropdown.options[dropdown.selectedIndex].text;

    infoText.innerHTML = `Αναζήτηση της λέξης <span>"${word}"</span>`;

    if (!dictionary[word]) {
        infoText.innerHTML = `Δεν μπόρεσα να βρω τη λέξη <span>"${word}"</span>. Παρακαλώ, δοκίμασε να ψάξεις μια άλλη λέξη!`
    }
    else {
        container.classList.add("active");    
        document.querySelector(".meaning span").innerText = dictionary[word].definition;
        document.querySelector(".example span").innerHTML = dictionary[word].example;
    }
}
