const dictionary = [[
    {
    "Όχι": {
      "meaning": ["Έχει επικρατήσει να λέγεται η Εθνική Επέτειος της 28ης Οκτωβρίου, Επέτειος του «ΟΧΙ», λόγω της άρνησης του Ιωάννη Μεταξά στο ιταλικό τελεσίγραφο παράδοσης της Ελλάδας στις 28.10.1940."],
      "example": ["Στις 28 Οκτωβρίου γιορτάζουμε την επέτειο του «Όχι»"],
    },     
    "σημαία": {
      "meaning": ["Σημαία είναι το εθνικό σύμβολο κάθε χώρας."],
      "example": ["Η ελληνική σημαία έχει εννέα λωρίδες κι έναν σταυρό."],
    },                
  }],
  [{
    "Άγιοι Σαράντα": {
      "meaning": ["πόλη στη νότια Αλβανία."],
      "example": ["Οι Άγιοι Σαράντα της Αλβανίας βρίσκονται μόνο δεκατέσσερα (14) χιλιόμετρα βορειοανατολικά της Κέρκυρας."],
    },  
    "αναχαιτίσουν": {
      "meaning": ["Να αποκρούσουν τον εχθρό και να τον οδηγήσουν σε οπισθοχώρηση."],
      "example": ["Οι ελληνικές μεραρχίες στρατού προσπάθησαν να αναχαιτίσουν τις ιταλικές δυνάμεις στην Αλβανία."],
    },  
    "Άξονας": {
      "meaning": ["Συνασπισμός Γερμανίας-Ιταλίας στην Ευρώπη και Ιαπωνίας στην Ασία κατά τον Β' Παγκόσμιο Πόλεμο."],
      "example": ["Οι Η.Π.Α. (Ηνωμένες Πολιτείες Αμερικής), όταν δέχτηκαν επίθεση από ιαπωνικά αεροπλάνα στο Περλ Χάρμπορ μπήκαν στον πόλεμο εναντίον της Ιαπωνίας και των δυνάμεων του «άξονα»."],
    },   
    "αποχώρηση": {
      "meaning": ["Όταν φεύγεις από κάπου,από κάποιον τόπο."],
      "example": ["12 Οκτωβρίου 1944 σημειώθηκε η γερμανική αποχώρηση και  γιορτάζουμε την απελευθέρωση της Ελλάδας."],
    },        
    "Αργυρόκαστρο": {
      "meaning": ["Πόλη της νότιας Αλβανίας."],
      "example": ["Υπάρχει εθνικοπατριωτικό τραγούδι για την 28η Οκτωβρίου με τίτλο:«Πήραμε τ' Αργυρόκαστρο»."],
    },   
    "αντεπίθεση": {
      "meaning": ["Επίθεση εναντίον κάποιου."],
      "example": ["Η αντεπίθεση και άμυνα των εχθρών δεν ήταν αναμενόμενη μετά τον αιφνιδιασμό τους (ξαφνική επίθεση) μέσα στη νύχτα."],
    },     
    "διέλευση": {
      "meaning": ["Η ελεύθερη πρόσβαση από κάπου, να περνάς δηλαδή ελεύθερα."],
      "example": ["Δεν επιτρέπεται η διέλευση του δρόμου, όταν υπάρχει απαγορευτική ταινία από την Αστυνομία."],
    }, 
    "επέδωσε": {
      "meaning": ["Έδωσε επίσημα,  Αόριστος του ρήματος: επιδίδω."],
      "example": ["Ο δημοτικός αστυνομικός επέδωσε κλήση στον παραβάτη οδηγό."],
    }, 
    "δικτάτορας": {
      "meaning": ["Αυτός που διατάζει και εξουσιάζει έναν τόπο/ συγκεντρώνει αυθαίρετα χωρίς εκλογές όλη την εξουσία."],
      "example": ["Ο Γεώργιος Παπαδόπουλος ήταν δικτάτορας και πρωτοστάτησε (πρωταγωνίστησε) στην στρατιωτική Δικτατορία της 21ης Απριλίου 1967."],
    },       
    "Ιωάννης Μεταξάς": {
      "meaning": ["(1871- 1941), ήταν στρατιωτικός, πολιτικός και δικτάτορας."],
      "example": ["Ο Ιωάννης Μεταξάς γεννήθηκε στην Ιθάκη και πέθανε στην Αθήνα."],
    },   
    "καταλάβει": {
      "meaning": ["Αόριστος του ρήματος καταλαμβάνω, είχε κατακτήσει, είχε κυριεύσει."],
      "example": ["Ο ιταλικός στρατός είχε καταλάβει εδάφη της Αλβανίας."],
    },  
    "ναζιστική": {
      "meaning": ["Ονομαζόταν η Γερμανία, όταν σε αυτή κυριαρχούσε ο Ναζισμός (βλέπε και φασιστικές παραπάνω) με επικεφαλής τον Αδόλφο Χίτλερ, δικτάτορα που είχε καταργήσει τη Δημοκρατία και την ελευθερία των ανθρώπων αλλά και του τύπου.   "],
      "example": ["Η ναζιστική Γερμανία(1933-1945) είχε πρωτεύουσά της το Βερολίνο."],
    },      
    "Κορυτσά": {
      "meaning": ["Πόλη στη Νοτιοανατολική Αλβανία."],
      "example": ["Με το σχολείο μας θα κάνουμε εκπαιδευτική επίσκεψη στην Κορυτσά της Αλβανίας."],
    },  
    "Πόγραδετς": {
      "meaning": ["Λέγεται και Πογραδέτσι και είναι πόλη στη Νοτιοανατολική Αλβανία."],
      "example": ["Η απόσταση Πόγραδετς-Τίρανα (πρωτεύουσα της Αλβανίας) είναι εκατόν τριάντα εννιά (139) χιλιόμετρα."],
    },   
    "προέλασαν": {
      "meaning": ["Αόριστος του ρήματος προελαύνω, προχώρησαν χωρίς να αντιμετωπίσουν αντίσταση από τον εχθρό."],
      "example": ["Ελληνικά στρατεύματα προέλασαν στα αλβανικά εδάφη.  "],
    },   
    "σύμμαχος": {
      "meaning": ["Αυτός που σε υποστηρίζει."],
      "example": ["Σε καιρό πολέμου ή ειρήνης, να έχεις συμμάχους είναι πολύ σημαντικό."],
    },   
    "τελεσίγραφο": {
      "meaning": ["Λόγοι προφορικοί ή γραπτοί (σε έγγραφο) που αφορούν όρους και προϋποθέσεις που ζητείται να εφαρμοστούν κι αν αυτό δεν γίνει διακόπτονται οι καλές σχέσεις."],
      "example": ["Τον Οκτώβριο του 1940 η Ιταλία έστειλε τελεσίγραφο για την παράδοση της Ελλάδας."],
    },         
    "φασιστικές": {
      "meaning": ["Αυταρχικές, καταπιεστικές συμπεριφορές που σχετίζονται πολιτικά με τον φασισμό= ιταλικό δικτατορικό και αυταρχικό καθεστώς του Μπενίτο Μουσολίνι."],
      "example": ["Φασιστικές είναι οι αποφάσεις που παίρνονται αντιδημοκρατικά, αυταρχικά, αυθαίρετα και βίαια."],
    },       
    "Χιμάρα": {
      "meaning": ["Χιμάρα ή Χειμάρα είναι πόλη κοντά στη θάλασσα, στη νότια Αλβανία."],
      "example": ["Το 1940 η Χιμάρα είχε καταληφθεί κι αυτή από τους Ιταλούς."],
    },                         
  }],
  [{
    "αλλόκοτο": {
      "meaning": ["Παράξενο"],
      "example": ["Ακούστηκε ένας αλλόκοτος ήχος από το βάθος του διαδρόμου κι όλοι μας τρομάξαμε!"],
    },     
    "Δέλτα": {
      "meaning": ["Πηνελόπη Δέλτα (1874-1941) Ελληνίδα συγγραφέας."],
      "example": ["Η Π. Δέλτα έγραφε κυρίως ιστορικά μυθιστορήματα για παιδιά όπως λ.χ. (λόγου χάρη) τα βιβλία με τίτλο: «Τον καιρό του Βουλγαροκτόνου» ή «Για την Πατρίδα», κ.α."],
    },     
    "εξιστορεί": {
      "meaning": ["Αφηγείται κάτι, διηγείται."],
      "example": ["Η αδελφή μου εξιστορεί με κάθε λεπτομέρεια τις καλοκαιρινές τις περιπέτειες στην κατασκήνωση."],
    },  
    "επιτροπή κουκλοθέατρου": {
      "meaning": ["Ο όμιλος κουκλοθεάτρου της σχολής Αηδονοπούλου που συμμετείχε η Άλκη Ζέη."],
      "example": ["Για την επιτροπή κουκλοθέατρου δημιουργήθηκε ο Κλούβιος."],
    },      
    "Λενούλα": {
      "meaning": ["Η μεγαλύτερη αδελφή της Άλκης Ζέη."],
      "example": ["Η Λενούλα αναφέρεται πολύ συχνά στο αυτοβιογραφικό βιβλίο της Άλκης Ζέη «Με μολύβι Φάμπερ νούμερο δύο». "],
    },  
    "μέσα από τα δόντια της": {
      "meaning": ["Έκφραση που σημαίνει ότι λέω κάτι σιγανά, συγκαλυμμένα. "],
      "example": ["Η αβέβαιη άρνησή της ακούστηκε μέσα από τα δόντια της και δεν μέτρησε στα «όχι»."],
    },      
    "σάλπιγγες": {
      "meaning": ["Χάλκινο πνευστό μουσικό όργανο."],
      "example": ["Η σάλπιγγα έχει αρκετές ομοιότητες με τη σημερινή τρομπέτα."],
    },     
    "σειρήνες": {
      "meaning": ["Σειρήνες πολέμου= ο ήχος που ακούγεται αν τεθεί συναγερμός για εχθρική επίθεση."],
      "example": ["«Τι πρέπει να κάνουμε, αν ακούσουμε τις σειρήνες του πολέμου να ηχούν»;, ρώτησε το μικρό παιδί τη μητέρα του."],
    },  
    "στρατεύονταν": {
      "meaning": ["Πήγαιναν να υπηρετήσουν στο στρατό."],
      "example": ["Στην Αθήνα της κλασικής εποχής οι μέτοικοι στρατεύονταν σε περίοδο πολέμου."],
    },            
  }],
  [{
    "Βέμπο": {
      "meaning": ["Σοφία Βέμπο, Ελληνίδα τραγουδίστρια."],
      "example": ["Η Σ. Βέμπο ονομαζόταν και «τραγουδίστρια της Νίκης», γιατί με τα τραγούδια της τόνιζε το ηθικό των Ελλήνων στρατιωτών στο μέτωπο του πολέμου."],
    },     
    "Ρώμη": {
      "meaning": ["Πρωτεύουσα της Ιταλίας."],
      "example": ["Το καλοκαίρι θα ταξιδέψω στην Ιταλία και θα επισκεφθώ στη Ρώμη οπωσδήποτε τη Φοντάνα Ντι Τρέβι (διάσημο συντριβάνι)."],
    },   
    "στραβοκάνης": {
      "meaning": ["Αυτός που έχει στραβά πόδια."],
      "example": ["Η κάλτσα που έπλεκε η Λενούλα ήταν τελείως στραβή και της έλεγαν κοροϊδευτικά ότι θα πρέπει να πάει σε κανέναν στραβοκάνη στρατιώτη."],
    },       
    "Τεπελένι": {
      "meaning": ["Πόλη στη νότια Αλβανία, στην αριστερή όχθη του ποταμού Αώου (τα εβδομήντα [70] χιλιόμετρα αυτού του ποταμού βρίσκονται στην Ελλάδα και τα υπόλοιπα εκατόν ενενήντα [190] στην Αλβανία)."],
      "example": ["Το Τεπελένι σημαίνει «Λόφος της Ελένης», μας εξήγησε η δασκάλα μας την ώρα της Γεωγραφίας."],
    },     
  }],
  [{
    "ανέγγιχτες": {
      "meaning": ["Άθικτες, που δεν τις έχει αγγίξει κανείς/καμία."],
      "example": ["Οι αρβύλες του Ιταλού στρατιώτη έμοιαζαν καινούριες, σχεδόν ανέγγιχτες."],
    },     
    "αρβύλες": {
      "meaning": ["Στρατιωτικές μπότες."],
      "example": ["«Όταν πηγαίνεις στο στρατό, τα παπούτσια που φοράς λέγονται αρβύλες», είπε ο παππούς Αντώνης στους εγγονούς του, Αχιλλέα και Αλκίνοο."],
    },     
    "έριχναν σουβλιές": {
      "meaning": ["Πόνος ισχυρός που τον αισθανόταν σαν να τον διαπερνούσε σουβλί (αιχμηρό εργαλείο για να ανοίγεις τρύπες σε ξύλο ή δέρμα), μούδιαζε από τον ισχυρό πόνο."],
      "example": ["Ο στρατιώτης από τον πόνο που αισθανόταν στα πόδια ήταν σαν να του έριχναν σουβλιές."],
    },     
    "κακουχίες": {
      "meaning": ["Οι εξαιρετικά πολύ μεγάλες δυσκολίες που αντιμετώπισαν οι Έλληνες στρατιώτες εξαιτίας του ψύχους στα χιονισμένα βουνά της Πίνδου."],
      "example": ["Ανάμεσα στις κακουχίες που αντιμετώπισαν οι Έλληνες στρατιώτες ήταν τα κρυοπαγήματα και οι ψείρες."],
    },  
    "κοκαλωμένα": {
      "meaning": ["Παγωμένα, άκαμπτα από το υπερβολικό κρύο."],
      "example": ["Οι κάλτσες και τα παπούτσια των στρατιωτών βρέχονταν από το χιόνι και αφού δεν στέγνωναν ήταν κοκαλωμένα από το κρύο."],
    }, 
    "gracia fratello": {
      "meaning": ["Στην ιταλική γλώσσα σημαίνει «Ευχαριστώ αδερφέ» "],
      "example": ["Ο Ιταλός στρατιώτης είπε στον παππού της Μαρίνας «gracia, fratello» κι εκείνος συγκινήθηκε πάρα πολύ κι έμεινε μαζί του ως το τέλος."],
    },            
  }],
  [{
    "αναγγελία του πολέμου": {
      "meaning": ["Η είδηση του πολέμου, το πολεμικό ανακοινωθέν."],
      "example": ["Η αναγγελία του πολέμου έχει καταγραφεί στις εφημερίδες εκείνης της εποχής. "],
    },   
    "ανακοινωθέν": {
      "meaning": ["Ανακοίνωση της είδησης."],
      "example": ["Το πολεμικό ανακοινωθέν της 28ης Οκτωβρίου 1940 (από το ελληνικό Γενικό Στρατηγείο)  υπάρχει ως ιστορικό ηχητικό ντοκουμέντο."],
    },     
    "δρώμενο": {
      "meaning": ["Σύντομο θεατρικό έργο."],
      "example": ["Με την τάξη μας παρουσιάσαμε ένα σύντομο θεατρικό δρώμενο με λόγο, κίνηση και χορό για την Κλιματική Αλλαγή και την Προστασία του Περιβάλλοντος."],
    },       
    "εθνικό φρόνημα": {
      "meaning": ["Εθνική συνείδηση, εθνική ενότητα (ομοψυχία), πεποίθηση, κοσμοθεωρία."],
      "example": ["Με το άκουσμα του εθνικού ύμνου τονώνεται το εθνικό φρόνημα."],
    },     
    "εισέβαλαν": {
      "meaning": ["Εισχώρησαν, μπήκαν με τη βία."],
      "example": ["Οι εχθροί εισέβαλαν στην ανοχύρωτη πόλη και την κατέλαβαν αμέσως."],
    }, 
    "είχαν επιταχθεί": {
      "meaning": ["Είχαν εξαφανιστεί/μαζευτεί με τη βία, παρά τη θέλησή τους."],
      "example": ["Όλα τα τρόφιμα είχαν επιταχθεί από τους Γερμανούς με αποτέλεσμα χιλιάδες Έλληνες να χάσουν τη ζωή τους από την πείνα. "],
    },     
    "είχε καταληφθεί": {
      "meaning": ["Ελέγχει μια περιοχή/ένα χώρο που πριν δεν είχε τον έλεγχο της/του."],
      "example": ["Την άνοιξη του 1941 η χώρα μας είχε καταληφθεί συνολικά από τα γερμανικά στρατεύματα."],
    },    
    "εκφωνητής": {
      "meaning": ["Αυτός που διαβάζει μπροστά σε κόσμο (δημόσια) ένα κείμενο (εκφωνεί λόγο) ή που ως επάγγελμα μιλάει σε κάποια εκπομπή στο ραδιόφωνο."],
      "example": ["Ο αγαπημένος μου ραδιοφωνικός σταθμός έχει εκφωνητή με μελωδική φωνή."],
    },      
    "ελεύθεραι ακόμα Αθήναι": {
      "meaning": ["Ελεύθερη ακόμα Αθήνα."],
      "example": ["Το ραδιόφωνο συνέχισε να εκπέμπει για λίγο μετά τη γερμανική εισβολή κι είναι χαρακτηριστική η φράση :«Εδώ ελεύθεραι ακόμα Αθήναι»."],
    },     
    "πρώτες ύλες": {
      "meaning": ["Είδη απαραίτητα για τη ζωή (π.χ. τρόφιμα) ή ορυκτά καύσιμα (κάρβουνο, πετρέλαιο, κ.α.)"],
      "example": ["Την περίοδο της Κατοχής υπήρχε έλλειψη στις πρώτες ύλες, ιδιαίτερα στη βενζίνη και οι άνθρωποι κυκλοφορούσαν με τα πόδια ή με γαϊδούρια."],
    },     
    "υπέφεραν": {
      "meaning": ["Αισθάνονταν πόνο (σωματικό ή ψυχικό) μη ανεκτό, βίωναν(ένιωθαν) αρνητικές εμπειρίες που δεν μπορούσαν να τις αντέξουν."],
      "example": ["Οι άνθρωποι υπέφεραν στα χρόνια της Κατοχής κι εξαιτίας της υπερβολικής πείνας."],
    },         
  }],
  [{
    "Άγνωστος Στρατιώτης": {
      "meaning": ["Μνημείο μπροστά από το κτίριο της Βουλής των Ελλήνων στην Πλατεία Συντάγματος."],
      "example": ["Κάθε Κυριακή στις 11.00 το πρωί είναι εντυπωσιακή η αλλαγή φρουράς στο μνημείο του Άγνωστου Στρατιώτη."],
    },       
    "αλαλαγμούς": {
      "meaning": ["Δυνατές κραυγές"],
      "example": ["Αλαλαγμοί χαράς ακούστηκαν από τα παιδιά στο άκουσμα της εκπαιδευτικής επίσκεψής τους  στο Πλανητάριο."],
    },  
    "διαμέσου": {
      "meaning": ["Μέσω, ανάμεσα"],
      "example": ["Οι δρομείς παρατάχτηκαν διαμέσου της λεωφόρου Αμαλίας στην Αθήνα."],
    },        
    "εισβολή": {
      "meaning": ["Εχθρική επίθεση με παραβίαση των συνόρων μιας χώρας."],
      "example": ["Η τουρκική εισβολή στην Κύπρο έγινε το 1974."],
    }, 
    "έκθαμβη": {
      "meaning": ["Έκπληκτη "],
      "example": ["Η Μιράντα έμεινε έκθαμβη μπροστά στο πανέμορφο νυφικό της ξαδέλφης της."],
    },     
    "Ιερά Οδός": {
      "meaning": ["Ο πιο αρχαίος ελληνικός δρόμος."],
      "example": ["Η Ιερά Οδός είναι ένας διάσημος δρόμος της Αθήνας."],
    }, 
    "Ιερός Βράχος": {
      "meaning": ["Το σημείο της Αθήνας στο οποίο βρίσκεται ο Παρθενώνας, το Ερέχθειο κι υπόλοιποι εμβληματικοί ναοί της κλασικής Αθήνας."],
      "example": ["Ο βραχώδης λόφος της Ακρόπολης ονομάζεται και ιερός βράχος."],
    },          
    "μηχανοκίνητες φάλαγγες": {
      "meaning": ["Στρατιωτικά οχήματα των Γερμανών κατακτητών."],
      "example": ["Οι μηχανοκίνητες φάλαγγες των Γερμανών εγκατέλειψαν την Αθήνα μέσω της Ιεράς οδού."],
    },   
    "ναζιστική σημαία": {
      "meaning": ["Η σημαία που αποκαλείται και σβάστικα. "],
      "example": ["Η υποστολή της ναζιστικής σημαίας από τον Μ. Γλέζο και τον Λ. Σάντα ήταν μία γενναία πράξη αντίστασης εναντίον των Γερμανών κατακτητών."],
    },      
    "ξεχυνόταν": {
      "meaning": ["Μετακινούνταν με ορμή"],
      "example": ["Όλο το βράδυ χθες πλήθος κόσμου ξεχυνόταν στους δρόμους για τους πανηγυρισμούς της νίκης!"],
    },    
    "Ομόνοια": {
      "meaning": ["Περιοχή στο κέντρο της Αθήνας, στην οποία βρίσκεται και πλατεία με το ίδιο όνομα."],
      "example": ["Όρισαν σημείο συνάντησης το σταθμό του Μετρό στην Ομόνοια."],
    },     
    "πανζουρλισμός": {
      "meaning": ["Πανδαιμόνιο, δηλαδή αναταραχή που προκαλείται από αναστατωμένο πλήθος κόσμου."],
      "example": ["Πανζουρλισμός επικράτησε από τους ξέφρενους πανηγυρισμούς για τη νίκη της εθνικής μας ομάδας."],
    },          
    "Πλατεία Συντάγματος": {
      "meaning": ["Η κεντρικότερη πλατεία της Αθήνας που ονομάζεται έτσι από το σύνταγμα που ζητούσαν οι Έλληνες από το βασιλιά Όθωνα, 3 Σεπτεμβρίου 1843."],
      "example": ["Στην πλατεία Συντάγματος βρίσκεται η στάση Μετρό του Συντάγματος."],
    },    
    "ποδοπάτησε": {
      "meaning": ["Πάτησε κάτι ή κάποιον/κάποια με βίαιο τρόπο με τα πόδια."],
      "example": ["Τη στιγμή του σεισμού πολλοί άνθρωποι ποδοπατήθηκαν μέσα στον πανικό τους."],
    }, 
    "πολεμόπληκτο": {
      "meaning": ["Που έχει πληγεί/υποφέρει από τον πόλεμο."],
      "example": ["Το πολεμόπληκτο μυαλό των παιδιών του πολέμου δυσκολευόταν να χωρέσει τα χαρμόσυνα νέα της απελευθέρωσης."],
    },     
    "πράσινα μανίκια": {
      "meaning": ["Μεσαιωνικό βρετανικό τραγούδι του 16ου αιώνα (green sleeves)."],
      "example": ["Η Λότη Πέτροβιτς- Ανδρουτσοπούλου στο βιβλίο της: Ο καιρός της σοκολάτας αναφέρει ότι τη «μάγευε» το μουσικό κομμάτι «πράσινα» μανίκια."],
    },  
    "σαστισμένη": {
      "meaning": ["Έκπληκτη, άναυδη"],
      "example": ["Η ηρωίδα του βιβλίου σαστισμένη παρακολουθούσε την εξέλιξη των γεγονότων για την απελευθέρωση της Αθήνας από τους Γερμανούς."],
    },        
    "υποστολή": {
      "meaning": ["Το κατέβασμα της σημαίας κατά τη δύση του ηλίου."],
      "example": ["Κατά τη διάρκεια της γερμανικής κατοχής η υποστολή της ναζιστικής σημαίας πραγματοποιήθηκε από τον Μανόλη Γλέζο και τον Λάκη Σάντα."],
    },     
    "Χέλμουτ Φέλμυ": {
      "meaning": ["Γερμανός στρατιωτικός που ανέλαβε στην Ελλάδα ως διοικητής στρατευμάτων το 1942-43."],
      "example": ["Ο Χέλμουτ Φέλμυ δικάστηκε ως εγκληματίας πολέμου στο δικαστήριο της Νυρεμβέργης."],
    },          
  }]
];